{
  "activation_dropout": 0.0,
  "apply_spec_augment": true,
  "architectures": [
    "SEWModel"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": 1,
  "conv_bias": false,
  "conv_dim": [
    64,
    128,
    128,
    128,
    128,
    256,
    256,
    256,
    256,
    512,
    512,
    512,
    512
  ],
  "conv_kernel": [
    10,
    3,
    1,
    3,
    1,
    3,
    1,
    3,
    1,
    2,
    1,
    2,
    1
  ],
  "conv_stride": [
    5,
    2,
    1,
    2,
    1,
    2,
    1,
    2,
    1,
    2,
    1,
    2,
    1
  ],
  "ctc_loss_reduction": "sum",
  "ctc_zero_infinity": false,
  "eos_token_id": 2,
  "feat_extract_activation": "gelu",
  "feat_extract_norm": "group",
  "feat_proj_dropout": 0.1,
  "final_dropout": 0.0,
  "hidden_act": "gelu",
  "hidden_dropout": 0.1,
  "hidden_size": 512,
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "layer_norm_eps": 1e-05,
  "layerdrop": 0.05,
  "mask_feature_length": 10,
  "mask_feature_prob": 0.0,
  "mask_time_length": 10,
  "mask_time_prob": 0.65,
  "model_type": "sew",
  "num_attention_heads": 8,
  "num_conv_pos_embedding_groups": 16,
  "num_conv_pos_embeddings": 31,
  "num_feat_extract_layers": 13,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "squeeze_factor": 2,
  "torch_dtype": "float32",
  "transformers_version": "4.12.0.dev0",
  "vocab_size": 32,
  "feature_extractor_type": "Wav2Vec2FeatureExtractor",
  "tokenizer_class": "Wav2Vec2CTCTokenizer"
}
